
   

   
Функция КлючРазработчика()
	
	Возврат "1C-DDPro-v4-32-1-fd045202-5e14-4b40-80b5-fc756069b76f";
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ddauth_api_client = КлючРазработчика();
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда) 
	Отказ = ПроверитьДанныеАвторизации();
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Логин", ЛогинНаСайтДиадок);
	СтруктураВозврата.Вставить("Пароль", ПарольНаСайтДиадок);
	СтруктураВозврата.Вставить("КлючРазработчикаДиадок", ddauth_api_client);
	
	Закрыть(СтруктураВозврата);
КонецПроцедуры


Функция ПроверитьДанныеАвторизации()   
	Отказ = Ложь;
		
	АдресРесурса = "/Authenticate?login="+ЛогинНаСайтДиадок+"&password="+ПарольНаСайтДиадок;
	АдресСайта = "diadoc-api.kontur.ru";
	HTTPЗапрос2 = Новый HTTPЗапрос;
	HTTPЗапрос2.Заголовки.Вставить("POST "+АдресРесурса+" HTTP/1.1");
	HTTPЗапрос2.Заголовки.Вставить("Host", "diadoc-api.kontur.ru");
	HTTPЗапрос2.Заголовки.Вставить("Content-Length", 0);
	HTTPЗапрос2.Заголовки.Вставить("Authorization", "DiadocAuth ddauth_api_client_id="+ddauth_api_client);
	HTTPЗапрос2.АдресРесурса = АдресРесурса;	
	
	Соединение1 = Новый HTTPСоединение(АдресСайта,,,, , ,Новый ЗащищенноеСоединениеOpenSSL(),Ложь); 
	ФайлРезультата = ПолучитьИмяВременногоФайла();
	Соединение1.ОтправитьДляОбработки(HTTPЗапрос2,ФайлРезультата);
	
	Ответ = Новый ТекстовыйДокумент();
	Ответ.Прочитать(ФайлРезультата, КодировкаТекста.UTF8);
	ТекстОтвета = Ответ.ПолучитьТекст();   
	Если Найти(ТекстОтвета, "Wrong") > 0 Тогда 
		Сообщить(ТекстОтвета);   
		Отказ = Истина;
	КонецЕсли;
	
	ВОзврат Отказ;
		
КонецФункции